result/-11k-1594405952.txt
wrk -t 20 -c 100 -d30s -R 5000 -file_k 11 --latency http://192.168.1.4:8089
Running 30s test @ http://192.168.1.4:8089
  20 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.02ms  383.17us   2.26ms   64.99%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%       1.02 ms
 75.000%       1.29 ms
 90.000%       1.52 ms
 99.000%       1.88 ms
 99.900%       2.08 ms
 99.990%       2.24 ms
 99.999%       2.27 ms
100.000%       2.27 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.135     0.000000            1         1.00
       0.501     0.100000         2024         1.11
       0.658     0.200000         4029         1.25
       0.791     0.300000         6039         1.43
       0.909     0.400000         8054         1.67
       1.022     0.500000        10066         2.00
       1.079     0.550000        11069         2.22
       1.135     0.600000        12081         2.50
       1.190     0.650000        13086         2.86
       1.241     0.700000        14088         3.33
       1.294     0.750000        15099         4.00
       1.323     0.775000        15597         4.44
       1.354     0.800000        16096         5.00
       1.388     0.825000        16601         5.71
       1.428     0.850000        17104         6.67
       1.472     0.875000        17605         8.00
       1.495     0.887500        17860         8.89
       1.524     0.900000        18112        10.00
       1.553     0.912500        18370        11.43
       1.580     0.925000        18619        13.33
       1.611     0.937500        18865        16.00
       1.630     0.943750        18994        17.78
       1.652     0.950000        19116        20.00
       1.674     0.956250        19241        22.86
       1.697     0.962500        19367        26.67
       1.731     0.968750        19493        32.00
       1.746     0.971875        19557        35.56
       1.762     0.975000        19619        40.00
       1.779     0.978125        19681        45.71
       1.799     0.981250        19747        53.33
       1.825     0.984375        19807        64.00
       1.836     0.985938        19838        71.11
       1.852     0.987500        19869        80.00
       1.870     0.989062        19903        91.43
       1.883     0.990625        19932       106.67
       1.901     0.992188        19963       128.00
       1.911     0.992969        19980       142.22
       1.929     0.993750        19997       160.00
       1.937     0.994531        20010       182.86
       1.949     0.995313        20026       213.33
       1.967     0.996094        20043       256.00
       1.971     0.996484        20050       284.44
       1.979     0.996875        20058       320.00
       1.992     0.997266        20065       365.71
       2.017     0.997656        20073       426.67
       2.046     0.998047        20082       512.00
       2.049     0.998242        20085       568.89
       2.061     0.998437        20089       640.00
       2.067     0.998633        20094       731.43
       2.079     0.998828        20099       853.33
       2.085     0.999023        20102      1024.00
       2.093     0.999121        20103      1137.78
       2.097     0.999219        20105      1280.00
       2.101     0.999316        20107      1462.86
       2.103     0.999414        20109      1706.67
       2.137     0.999512        20111      2048.00
       2.141     0.999561        20112      2275.56
       2.143     0.999609        20113      2560.00
       2.153     0.999658        20114      2925.71
       2.171     0.999707        20115      3413.33
       2.181     0.999756        20116      4096.00
       2.181     0.999780        20116      4551.11
       2.209     0.999805        20117      5120.00
       2.209     0.999829        20117      5851.43
       2.237     0.999854        20118      6826.67
       2.237     0.999878        20118      8192.00
       2.237     0.999890        20118      9102.22
       2.241     0.999902        20119     10240.00
       2.241     0.999915        20119     11702.86
       2.241     0.999927        20119     13653.33
       2.241     0.999939        20119     16384.00
       2.241     0.999945        20119     18204.44
       2.265     0.999951        20120     20480.00
       2.265     1.000000        20120          inf
#[Mean    =        1.019, StdDeviation   =        0.383]
#[Max     =        2.264, Total count    =        20120]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  20120 requests in 4.03s, 16.31MB read
Requests/sec:   4998.40
Transfer/sec:      4.05MB
Running 30s test @ http://192.168.1.4:8089
  20 threads and 100 connections
  Thread calibration: mean lat.: 1.043ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.975ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.020ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.050ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.022ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.041ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.008ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.010ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.993ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.011ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.992ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.015ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.943ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.029ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.977ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.010ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.026ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.044ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.064ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.026ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05ms  417.50us  41.76ms   69.50%
    Req/Sec   267.00     60.56   444.00     58.60%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%       1.07 ms
 75.000%       1.31 ms
 90.000%       1.55 ms
 99.000%       1.95 ms
 99.900%       2.18 ms
 99.990%       2.38 ms
 99.999%      21.95 ms
100.000%      41.79 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.141     0.000000            1         1.00
       0.493     0.100000        10026         1.11
       0.691     0.200000        19977         1.25
       0.847     0.300000        30030         1.43
       0.966     0.400000        39971         1.67
       1.070     0.500000        50024         2.00
       1.119     0.550000        55022         2.22
       1.167     0.600000        59996         2.50
       1.212     0.650000        65000         2.86
       1.258     0.700000        69945         3.33
       1.306     0.750000        74923         4.00
       1.333     0.775000        77487         4.44
       1.363     0.800000        79917         5.00
       1.399     0.825000        82383         5.71
       1.444     0.850000        84902         6.67
       1.494     0.875000        87391         8.00
       1.521     0.887500        88661         8.89
       1.551     0.900000        89889        10.00
       1.582     0.912500        91127        11.43
       1.617     0.925000        92367        13.33
       1.658     0.937500        93635        16.00
       1.679     0.943750        94243        17.78
       1.701     0.950000        94883        20.00
       1.725     0.956250        95487        22.86
       1.753     0.962500        96129        26.67
       1.785     0.968750        96752        32.00
       1.802     0.971875        97053        35.56
       1.822     0.975000        97367        40.00
       1.844     0.978125        97675        45.71
       1.867     0.981250        97987        53.33
       1.894     0.984375        98295        64.00
       1.909     0.985938        98451        71.11
       1.925     0.987500        98610        80.00
       1.942     0.989062        98763        91.43
       1.961     0.990625        98924       106.67
       1.984     0.992188        99075       128.00
       1.995     0.992969        99153       142.22
       2.012     0.993750        99232       160.00
       2.029     0.994531        99310       182.86
       2.045     0.995313        99387       213.33
       2.065     0.996094        99469       256.00
       2.073     0.996484        99506       284.44
       2.089     0.996875        99544       320.00
       2.105     0.997266        99582       365.71
       2.121     0.997656        99621       426.67
       2.135     0.998047        99661       512.00
       2.143     0.998242        99680       568.89
       2.153     0.998437        99698       640.00
       2.165     0.998633        99719       731.43
       2.175     0.998828        99739       853.33
       2.187     0.999023        99758      1024.00
       2.205     0.999121        99769      1137.78
       2.215     0.999219        99778      1280.00
       2.223     0.999316        99787      1462.86
       2.237     0.999414        99799      1706.67
       2.247     0.999512        99806      2048.00
       2.253     0.999561        99814      2275.56
       2.277     0.999609        99815      2560.00
       2.291     0.999658        99820      2925.71
       2.303     0.999707        99826      3413.33
       2.331     0.999756        99830      4096.00
       2.339     0.999780        99834      4551.11
       2.345     0.999805        99835      5120.00
       2.351     0.999829        99837      5851.43
       2.363     0.999854        99840      6826.67
       2.379     0.999878        99842      8192.00
       2.383     0.999890        99844      9102.22
       2.389     0.999902        99846     10240.00
       2.389     0.999915        99846     11702.86
       2.397     0.999927        99847     13653.33
       2.401     0.999939        99848     16384.00
       2.433     0.999945        99849     18204.44
       2.487     0.999951        99850     20480.00
       2.487     0.999957        99850     23405.71
       2.511     0.999963        99851     27306.67
       2.511     0.999969        99851     32768.00
       2.553     0.999973        99852     36408.89
       2.553     0.999976        99852     40960.00
       2.553     0.999979        99852     46811.43
      21.951     0.999982        99853     54613.33
      21.951     0.999985        99853     65536.00
      21.951     0.999986        99853     72817.78
      21.951     0.999988        99853     81920.00
      21.951     0.999989        99853     93622.86
      41.791     0.999991        99854    109226.67
      41.791     1.000000        99854          inf
#[Mean    =        1.050, StdDeviation   =        0.418]
#[Max     =       41.760, Total count    =        99854]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149995 requests in 30.00s, 121.58MB read
Requests/sec:   4999.80
Transfer/sec:      4.05MB